# DuctFittingAndAccessoryConnectorData Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DuctFittingAndAccessoryConnectorData Members
DuctFittingAndAccessoryConnectorData Class Methods Properties See Also
---
The DuctFittingAndAccessoryConnectorData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the DuctFittingAndAccessoryConnectorData |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetCoordination | Gets the coordination of the connector |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Angle | the angle of the fitting, Units:(rad). |
| Diameter | The connector diameter, Units:(ft). |
| Flow | The connector flow, Units:(ft³/s) |
| FlowDirection | the flow direction of this connector, In or Out. |
| Height | The connector height, Units:(ft). |
| Index | return the index of this connector |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| LinkIndex | the index of the connector which is linked with this connector |
| Profile | The connector profile. |
| VelocityPressure | The connector velocity pressure. Units: (kg/(ft·s²)). |
| Width | The connector width, Units:(ft). |

# See Also
DuctFittingAndAccessoryConnectorData Class
Autodesk.Revit.DB.Mechanical Namespace